Repository: starlose13/BlockchainEnviroComm
Catalog: docs/locale/*/LC_MESSAGES/docs_chainlink_automation_contract.po
Languages: fa

source: ChainlinkAutomation Contract Documentation
fa: مستندات قرارداد ChainlinkAutomation

source: Overview
fa: بررسی کلی

source: The `ChainlinkAutomation` contract is a pivotal component designed to interface with Chainlink's automation services. This contract leverages Chainlink’s decentralized oracle network to execute predefined functions at specified intervals, enabling automated execution of periodic tasks. It is engineered to enhance the reliability and efficiency of task scheduling in smart contract environments.
fa: قرارداد `ChainlinkAutomation` یکی از اجزای کلیدی است که برای ارتباط با خدمات اتوماسیون Chainlink طراحی شده است. این قرارداد از شبکه غیرمتمرکز اوراکل Chainlink برای اجرای توابع از پیش تعریف شده در فواصل زمانی مشخص استفاده می‌کند و به اجرای خودکار وظایف دوره‌ای کمک می‌کند. این قرارداد برای بهبود قابلیت اطمینان و کارایی برنامه‌ریزی وظایف در محیط‌های قرارداد های هوشمند طراحی شده است.

source: Key Components
fa: اجزای کلیدی

source: **State Variables:**
fa: **متغیرهای وضعیت:**

source: `s_lastTimeStamp` (uint256): - Records the timestamp of the last successful Chainlink automation execution. This variable is critical for determining the elapsed time since the last execution and ensuring adherence to the defined schedule.
fa: `s_lastTimeStamp` (uint256): - زمان‌سنج آخرین اجرای موفق Chainlink automation را ثبت می‌کند. این متغیر برای تعیین زمان گذشته از آخرین اجرا و اطمینان از رعایت برنامه‌ریزی تعریف شده ضروری است.

source: `s_interval` (uint256): - Specifies the interval (in seconds) between successive executions. This parameter governs the frequency of automation tasks and is crucial for scheduling tasks effectively.
fa: `s_interval` (uint256): - فاصله زمانی (بر حسب ثانیه) بین اجراهای متوالی را مشخص می‌کند. این پارامتر فرکانس وظایف اتوماسیون را تنظیم می‌کند و برای برنامه‌ریزی مؤثر وظایف بسیار مهم است.

source: `CHAINLINK_JOB_ID` (bytes32): - Represents the unique job identifier for Chainlink automation. This ID is used to link the contract with a specific Chainlink job configured to trigger automation.
fa: `CHAINLINK_JOB_ID` (bytes32): - شناسه منحصر به فرد شغل برای اتوماسیون Chainlink را نمایندگی می‌کند. این شناسه برای پیوند قرارداد با یک شغل خاص Chainlink که برای تحریک اتوماسیون پیکربندی شده است، استفاده می‌شود.

source: `CHAINLINK_ORACLE_ADDRESS` (address): - Contains the address of the Chainlink oracle responsible for executing the automation tasks. Ensuring the correctness of this address is vital for successful integration with Chainlink services.
fa: `CHAINLINK_ORACLE_ADDRESS` (address): - آدرس اوراکل Chainlink که مسئول اجرای وظایف اتوماسیون است را در بر دارد. اطمینان از صحت این آدرس برای ادغام موفق با خدمات Chainlink حیاتی است.

source: Description of the image
fa: توضیحات تصویر

source: **Functions:**
fa: **توابع:**

source: **Set Interval** ```solidity function setInterval(uint256 interval) external ``` - Sets the time interval between automation executions. The interval must be defined in seconds and should be configured considering both operational needs and resource constraints.
fa: **تنظیم فاصله زمانی** ```solidity function setInterval(uint256 interval) external ``` - فاصله زمانی بین اجرای وظایف اتوماسیون را تنظیم می‌کند. این فاصله باید بر حسب ثانیه تعریف شود و باید با توجه به نیازهای عملیاتی و محدودیت‌های منابع پیکربندی شود.

source: **Perform Automation** ```solidity function performAutomation() external ``` - Executes the automation tasks based on the configured interval and current timestamp. This function is triggered by Chainlink's oracle service and is responsible for performing the scheduled tasks.
fa: **اجرای اتوماسیون** ```solidity function performAutomation() external ``` - وظایف اتوماسیون را بر اساس فاصله زمانی پیکربندی شده و زمان‌سنج فعلی اجرا می‌کند. این تابع توسط سرویس اوراکل Chainlink تحریک می‌شود و مسئول انجام وظایف برنامه‌ریزی شده است.

source: **Update Job ID** ```solidity function updateJobID(bytes32 jobId) external ``` - Updates the Chainlink job ID used for automation. This function allows for reconfiguration of the job link, enabling adjustments in the Chainlink job configuration if required.
fa: **به‌روزرسانی شناسه شغل** ```solidity function updateJobID(bytes32 jobId) external ``` - شناسه شغل Chainlink مورد استفاده برای اتوماسیون را به‌روزرسانی می‌کند. این تابع امکان پیکربندی مجدد پیوند شغل را فراهم می‌کند و به شما اجازه می‌دهد در صورت لزوم تنظیمات شغل Chainlink را تغییر دهید.

source: Application
fa: کاربرد

source: The `ChainlinkAutomation` contract is designed to automate routine tasks by utilizing Chainlink’s decentralized oracle network. Its applications include:
fa: قرارداد `ChainlinkAutomation` برای خودکارسازی وظایف روتین با استفاده از شبکه غیرمتمرکز اوراکل Chainlink طراحی شده است. کاربردهای آن شامل موارد زیر است:

source: **Data Feed Updates:** Automated updates to data feeds, ensuring that smart contracts interact with the most recent data.
fa: **به‌روزرسانی‌های داده‌ای:** به‌روزرسانی‌های خودکار به داده‌ها، اطمینان از اینکه قراردادهای هوشمند با جدیدترین داده‌ها تعامل دارند.

source: **Routine Functions:** Execution of periodic functions, such as recalculating values or triggering events on a regular basis.
fa: **توابع دوره‌ای:** اجرای توابع دوره‌ای، مانند محاسبه مجدد مقادیر یا تحریک رویدادها به‌طور منظم.

source: **Scheduled Interactions:** Interaction with other smart contracts on a defined schedule, facilitating complex multi-contract operations without manual intervention.
fa: **تعاملات زمان‌بندی شده:** تعامل با سایر قراردادهای هوشمند طبق یک برنامه تعریف شده، تسهیل عملیات پیچیده چندقراردادی بدون نیاز به مداخله دستی.

source: Security Considerations
fa: ملاحظات امنیتی

source: **Chainlink Integration:** Ensure accurate configuration of the Chainlink job ID and oracle address to avoid failures in automation tasks. Verify the integrity of these parameters to maintain reliable operation.
fa: **ادغام Chainlink:** از پیکربندی صحیح شناسه شغل و آدرس اوراکل Chainlink اطمینان حاصل کنید تا از بروز خطا در وظایف اتوماسیون جلوگیری شود. صحت این پارامترها را بررسی کنید تا عملکرد قابل اطمینان حفظ شود.

source: **Interval Management:** Carefully balance the interval settings to optimize resource utilization. A short interval may lead to increased transaction costs and excessive oracle calls, whereas a long interval might delay important updates. Analyze the system's requirements to determine an optimal interval.
fa: **مدیریت فاصله زمانی:** تنظیمات فاصله زمانی را به دقت متعادل کنید تا از استفاده بهینه از منابع اطمینان حاصل شود. فاصله زمانی کوتاه ممکن است به افزایش هزینه‌های تراکنش و تماس‌های اضافی با اوراکل منجر شود، در حالی که فاصله زمانی طولانی ممکن است به تأخیر در به‌روزرسانی‌های مهم منجر شود. نیازهای سیستم را تجزیه و تحلیل کنید تا فاصله زمانی بهینه را تعیین کنید.

source: **Access Control:** Implement robust access control mechanisms to safeguard the contract from unauthorized modifications. Ensure that only trusted and authorized entities can adjust the interval or job ID to prevent malicious interference.
fa: **کنترل دسترسی:** مکانیزم‌های کنترل دسترسی قوی را پیاده‌سازی کنید تا از قرارداد در برابر تغییرات غیرمجاز محافظت کنید. اطمینان حاصل کنید که تنها اشخاص مورد اعتماد و مجاز بتوانند فاصله زمانی یا شناسه شغل را تنظیم کنند تا از دخالت‌های مخرب جلوگیری شود.

source: **Error Handling:** Incorporate comprehensive error handling and logging to manage potential issues during automation execution. Enable mechanisms to capture and address any errors that arise, ensuring the system’s resilience and reliability.
fa: **مدیریت خطا:** شامل مدیریت و ثبت خطاهای جامع برای مدیریت مشکلات احتمالی در حین اجرای اتوماسیون باشید. مکانیزم‌هایی را فعال کنید تا هر خطای بروز یافته را شناسایی و رسیدگی کنید و از تاب‌آوری و قابلیت اطمینان سیستم اطمینان حاصل کنید.

source: Additional Expert Insights
fa: بینش‌های اضافی کارشناسان

source: **Chainlink Job Configuration:** When configuring Chainlink jobs, ensure that the job specifications align with the automation requirements. Consider setting up monitoring for job performance and execution metrics to proactively address any anomalies.
fa: **پیکربندی شغل Chainlink:** هنگام پیکربندی شغل‌های Chainlink، اطمینان حاصل کنید که مشخصات شغل با نیازهای اتوماسیون همخوانی داشته باشد. در نظر داشته باشید که نظارت بر عملکرد شغل و شاخص‌های اجرایی را راه‌اندازی کنید تا به‌طور پیشگیرانه به هرگونه ناهنجاری رسیدگی کنید.

source: **Oracle Fees:** Be aware of the fees associated with Chainlink oracles. Configure the contract to handle variations in fee structures and ensure sufficient funds are available for uninterrupted automation.
fa: **هزینه‌های اوراکل:** از هزینه‌های مربوط به اوراکل‌های Chainlink آگاه باشید. قرارداد را به‌گونه‌ای پیکربندی کنید که بتواند تغییرات در ساختار هزینه‌ها را مدیریت کند و اطمینان حاصل کنید که وجوه کافی برای اتوماسیون بدون وقفه موجود باشد.

source: **Testing and Simulation:** Before deploying the `ChainlinkAutomation` contract to a production environment, conduct thorough testing and simulation in a controlled environment. Validate the contract’s behavior under various conditions to ensure reliable operation.
fa: **آزمایش و شبیه‌سازی:** قبل از استقرار قرارداد `ChainlinkAutomation` در محیط تولید، آزمایش و شبیه‌سازی کاملی را در محیط کنترل شده انجام دهید. رفتار قرارداد را تحت شرایط مختلف تأیید کنید تا از عملکرد قابل اعتماد اطمینان حاصل کنید.

source: **Versioning and Upgrades:** Consider implementing mechanisms for versioning and upgrading the contract to accommodate future enhancements or changes in Chainlink’s services. This approach will help maintain the contract’s relevance and functionality over time.
fa: **نسخه‌بندی و به‌روزرسانی‌ها:** در نظر داشته باشید که مکانیزم‌های نسخه‌بندی و به‌روزرسانی قرارداد را پیاده‌سازی کنید تا به بهبودهای آینده یا تغییرات در خدمات Chainlink پاسخگو باشید. این رویکرد به حفظ مربوط بودن و عملکرد قرارداد در طول زمان کمک می‌کند.
